new_kEp/0/2.4/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "2.4";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
535928
(
(0.00021107 16.5849 0.00779628)
(-1.8618e-05 16.5754 0.018765)
(-6.92985e-06 16.5532 0.0221225)
(3.5562e-05 16.5263 0.0238969)
(1.93875e-05 16.4988 0.0252571)
(2.72743e-06 16.4707 0.0262862)
(-2.13998e-06 16.4419 0.0270561)
(-4.23738e-06 16.4126 0.0276551)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 16.6 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall3
    {
        type            noSlip;
    }
    wall4
    {
        type            noSlip;
    }
    wall5
    {
        type            noSlip;
    }
    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type            symmetry;
    }
}


// ************************************************************************* //
