new_kEp/0/2.4/UMean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "2.4";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
535928
(
(0.000990374 16.5805 0.0059667)
(0.000710646 16.5678 0.0163547)
(0.000630299 16.5425 0.0191976)
(0.000664701 16.5126 0.0208595)
(0.000609079 16.4824 0.0221983)
(0.000556078 16.4521 0.0232662)
(0.0005272 16.4215 0.0239864)
(0.000490804 16.3908 0.0245401)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 16.6 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
1922
(
(0.0120369 16.9728 0.103359)
(-0.00398593 16.3948 0.0872641)
(0.00378174 16.7021 -0.0726511)
(0.0121018 16.788 0.102147)
(-0.00372021 16.2474 0.0847817)
(0.00442557 16.5881 -0.0723227)
(-0.00149576 15.5761 0.0672672)
(0.0119029 16.6176 0.0999816)
...
)
;
    }
    wall1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    wall2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    wall3
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    wall4
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    wall5
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type            symmetry;
    }
}


// ************************************************************************* //
