new_kEp/0/2.4/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "2.4";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
535928
(
212.152
223.167
234.226
245.266
256.258
267.183
278.023
288.76
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 61.644;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
9424
(
212.151
223.165
234.224
245.264
256.257
267.183
278.026
288.769
...
)
;
    }
    wall2
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
9424
(
1123.72
1132.41
1141.32
1150.51
1160.03
1169.87
1180.04
1190.54
...
)
;
    }
    wall3
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
620
(
13375.8
13005.4
13738.5
15208.1
17291.9
19962.5
23216.5
26932.3
...
)
;
    }
    wall4
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
589
(
22264.5
22197.7
22125.7
22058.4
22007.4
21972.6
21948.9
21928.4
...
)
;
    }
    wall5
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
589
(
26478
26386.5
26296.8
26202.2
26130.2
26079.6
26044.5
26013.7
...
)
;
    }
    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type            symmetry;
    }
}


// ************************************************************************* //
