new_kEp/0/2.4/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "2.4";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
535928
(
1.05132
1.08741
1.12304
1.15806
1.19241
1.22606
1.259
1.29121
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.03335;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
9424
(
1.05132
1.0874
1.12303
1.15805
1.1924
1.22606
1.25901
1.29124
...
)
;
    }
    wall2
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
9424
(
2.43936
2.45194
2.46481
2.47806
2.49173
2.50584
2.52037
2.53533
...
)
;
    }
    wall3
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
620
(
5.50229
5.39123
5.5765
5.9589
6.4867
7.13863
7.89832
8.72675
...
)
;
    }
    wall4
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
589
(
6.85762
6.84296
6.82694
6.81172
6.79992
6.79163
6.78584
6.78083
...
)
;
    }
    wall5
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
589
(
7.69282
7.67427
7.65548
7.63546
7.61985
7.60856
7.60051
7.5935
...
)
;
    }
    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type            symmetry;
    }
}


// ************************************************************************* //
