new_kEp/0/2.4/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "2.4";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
535928
(
0.000468888
0.000476867
0.000484618
0.000492115
0.00049936
0.000506357
0.000513115
0.000519638
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.001559;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1922
(
0.0150115
0.0167254
0.018064
0.0158796
0.0172427
0.0183294
0.0191372
0.0165644
...
)
;
    }
    wall1
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
9424
(
5.67764e-05
5.77498e-05
5.86936e-05
5.96048e-05
6.04839e-05
6.13316e-05
6.2149e-05
6.29369e-05
...
)
;
    }
    wall2
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
9424
(
5.76631e-05
5.78126e-05
5.7965e-05
5.81215e-05
5.82825e-05
5.84481e-05
5.86181e-05
5.87927e-05
...
)
;
    }
    wall3
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
620
(
2.27474e-05
2.24688e-05
2.29318e-05
2.38608e-05
2.50892e-05
2.65311e-05
2.81204e-05
2.9758e-05
...
)
;
    }
    wall4
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
589
(
2.11602e-05
2.11323e-05
2.11018e-05
2.10728e-05
2.10502e-05
2.10344e-05
2.10233e-05
2.10138e-05
...
)
;
    }
    wall5
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
589
(
2.26968e-05
2.26638e-05
2.26302e-05
2.25944e-05
2.25665e-05
2.25462e-05
2.25318e-05
2.25192e-05
...
)
;
    }
    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type            symmetry;
    }
}


// ************************************************************************* //
