new_kEp/0/2.4/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "2.4";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1578561
(
5.17613e-05
4.12002e-08
6.49234e-09
5.16951e-05
6.75288e-08
-1.32778e-09
5.16186e-05
7.64812e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1302
(
-4.14728e-05
-3.39721e-05
-0.000131267
-0.000128145
-0.000128147
-0.000128147
-0.000128147
-0.000128147
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1922
(
8.407e-05
4.05552e-05
9.69564e-05
7.60309e-05
3.48767e-05
8.44057e-05
1.16071e-05
6.35034e-05
...
)
;
    }
    wall1
    {
        type            calculated;
        value           uniform 0;
    }
    wall2
    {
        type            calculated;
        value           uniform 0;
    }
    wall3
    {
        type            calculated;
        value           uniform 0;
    }
    wall4
    {
        type            calculated;
        value           uniform 0;
    }
    wall5
    {
        type            calculated;
        value           uniform 0;
    }
    frontwall
    {
        type            symmetry;
        value           nonuniform List<scalar> 
17288
(
-7.81944e-25
-4.84297e-26
-1.09305e-26
-1.24451e-26
-3.09486e-26
9.28963e-27
3.02923e-27
1.969e-27
...
)
;
    }
    backwall
    {
        type            symmetry;
        value           uniform 0;
    }
}


// ************************************************************************* //
