new_kEp/0/2.4/vorticityMag
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "2.4";
    object      vorticityMag;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
535928
(
4071
4072.37
4071.81
4069.14
4066.17
4063.01
4059.65
4056.12
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1302
(
0.230402
0.239861
4070.62
3.47489
2.83281
1.66623
1.11663
0.773248
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1922
(
56.0325
58.1694
51.2503
57.0637
57.6641
51.7094
51.3669
56.873
...
)
;
    }
    wall1
    {
        type            calculated;
        value           nonuniform List<scalar> 
9424
(
8140.79
8137.45
8128.25
8115.7
8102.77
8089.8
8076.67
8063.45
...
)
;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<scalar> 
9424
(
16263.1
16318.5
16373.9
16428.6
16482.2
16534.4
16584.8
16633.1
...
)
;
    }
    wall3
    {
        type            calculated;
        value           nonuniform List<scalar> 
620
(
11768.7
10373.4
10607.5
11170.8
11911.9
12518.6
12703.8
12167.4
...
)
;
    }
    wall4
    {
        type            calculated;
        value           nonuniform List<scalar> 
589
(
28322.8
28327.1
28321.7
28324.5
28325.5
28324.9
28321.9
28314.5
...
)
;
    }
    wall5
    {
        type            calculated;
        value           nonuniform List<scalar> 
589
(
15597.6
15616.6
15632.6
15647.4
15656.6
15664.2
15673.1
15687
...
)
;
    }
    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type            symmetry;
    }
}


// ************************************************************************* //
